12/data/attachments/783c5f52f3d15e66.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e0f9dee1-0ec6-4b6c-b516-04b7e82d8ed8</nif:username>
            <nif:friendToBeAdded>Shannon_thank_Actions_12674_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>